const boss = [
    "索尔巴斯", "施毒者黑烟", "变异龙蝇", "边境巨炮", "机甲夜盗蝇", "幽灵战车", "机师小珍", "机师卢瑟", 
    "岁郎", "G病毒艾亚", "艾亚", "黑牙兄弟", "宿主胖藤木", "角螳螂", "黑烟", "火甲虫", 
    "育母神", "黑暗快车", "巫毒", "基米尔I型", "傀儡地龙王", "赏金首领黑烟", "麦管皇后", "珊瑚刺", "鬼影角螳螂",
]

const car = ['uf-β', '三角力量', '不沉舰', '决斗者', '判罪者', '反黑先锋', '台风陀螺', '吉米', '哈罗', '圣盾', '地脉斗客', '基可洛', '夜舞者', '奶油派', '守护者K', '守望射手', '崩灭', '巨炮', '开拓钻头', '恶梦', '战戟', '挖挖号', '新绿连星', '无畏号', '星之屑', '暗黑帝王', '歌姆', '正义', '武装诺亚', '毁灭', '洛萨尔', '海皇号', '湛蓝意志', '湛蓝连星', '狙击流星', '破军', '秃鹰', '血沙鲁', '赤红连星', '赤色堡垒', '赤色要塞', '超级南瓜', '跃动', '闪影翼', '雪团团', '雪莉', '雷雨云', '魔音塔塔', '黑牙']

const map = [
    "热泥沼泽", "彩虹泉", "马克研究所", "王牌空岛", "战车墓地", "盗蝇巢穴", 
    "大管道", "浅雾滩", "生活区", "临时营地", "采掘场", "雷牙高地", "白夜雪原",
    "整备间", "晶角洞窟", "废弃矿坑", "医护车", "废弃矿洞", "黑夜森林", "训练间",
    "飞行层", "大管道", "伽土姆大桥" ,"研究间", "休息室"
]

const monster = ['仙女蝶', '仿生天牛', '吐痰藤', '响果蝠', '夜盗蝇', '寄居蜗牛', '履带雪球', '弹簧蛛', '懒散天牛', '扫荡者', '掠夺者', '水星贝', '流弹蚊', '滚雷石', '热黏菌', '白地龙', '盗蝇狙击手', '砂地蟹', '砂盗蝇', '绿地蟹', '萤火球', '蝇族先锋', '迷你蝇群', '铁魂', '防御机器', '降雨雪球', '黑地龙']

const npc = [
    'M博士', '丹博士', '克莱尔', '兰特', '吉拉斯', '吉拉豆', '图卢', '夏洛丝', 
    '奥缇娜', '布克', '托达克', '斯伽', '沃森', 
    '湛蓝之源车队', '胖荷', '能源议会', '茜尔', '莉达', '莫雷拉', 
    '萝洁拉', '诺兰', '贝尔吉', '邦尼', '长草猎手车队', '隆', '马克', '麦琪'
]

const other = [
    "生存手则", 
    "莱拉"
]

const miji = [
    "2012-11-27_安特进行曲父亲的记忆任务攻略2", "2012-12-15_安特进行曲入侵的变异怪物任务攻略",
    "2012-12-15_安特进行曲真假女皇任务攻略", "2012-12-15_安特进行曲奥缇娜的困扰任务攻略",
    "2012-12-05_安特进行曲不安的大陆任务攻略", "2012-12-04_安特进行曲苏醒的巨兽任务攻略",
    "2012-10-24_安特进行曲营救茜儿(上)任务攻略", "2012-10-25_安特进行曲营救茜儿(下)任务攻略",
    "2012-11-23_安特进行曲挑战艾亚任务攻略", "2012-11-23_安特进行曲重返热泥沼泽任务攻略",
    "2012-10-11_安特进行曲流浪机师任务攻略", "2012-09-20_安特进行曲保护账号人人有责任务攻略",
    "2012-09-12_安特进行曲湛蓝之源任务攻略", "2012-09-18_安特进行曲父亲的记忆任务攻略",
    "2012-09-06_安特进行曲怒火甲虫任务攻略", "2012-09-03_安特进行曲邪恶博士DrM任务攻略",
    "2012-08-14_安特进行曲黑夜森林任务攻略", "2012-08-02_安特进行曲能源议会任务攻略",
    "2012-07-30_安特进行曲星星的传说", "2012-07-16_安特进行曲之不速之客",
    "2012-07-20_安特进行曲牙与网任务攻略", "2012-05-04_安特进行曲伙伴募集活动",
    "2012-06-04_安特进行曲恶梦的制造", "2012-05-04_安特进行曲夺宝奇兵介绍",
    "2012-06-08_安特进行曲避热的方法"
]

const news = [
    "2012-10-09_安特进行曲金秋季执勤", "2012-07-26_安特进行曲仲夏季执勤",
    "2012-06-21_安特进行曲补偿公告", "2012-01-09_千军破战友招募1月6日更新内容"
]

const mission = [
    "2012-06-29_安特进行曲黑夜之袭", "2012-06-08_安特进行曲智能VS幽灵",
    "2012-05-25_安特进行曲沸腾之棕", "2012-05-25_安特进行曲御热的冰泡",
    "2012-05-25_安特进行曲进发热泥沼泽", "2012-06-25_安特进行曲登场幽灵战车攻略",
    "2012-06-25_安特进行曲不安的开端", "2012-06-25_安特进行曲嫉妒的音符",
    "2012-07-07_安特进行曲之黄油菇", "2011-11-15_安特进行曲天才机师的诞生",
    "2012-05-31_安特进行曲履带雪球打法攻略",
]

const update = [
    "2012-05-21_安特进行曲5月18日更新公告", "2012-05-31_安特进行曲5月31日更新公告",
    "2012-08-10_安特进行曲8月10日更新公告", "2012-09-29_安特进行曲9月29日更新公告",
    "2012-10-26_安特进行曲10月26日更新公告", "2012-11-02_安特进行曲11月2日更新公告"
]

const ask = [
    "2012-05-18_安特进行曲的蛛网小洞在哪里采集", "2012-07-25_安特进行曲彩虹花瓣怎么得到",
    "2012-05-22_安特进行曲破损螺母怎么得"
]

export { boss, car, map, monster, npc, other, miji, news, mission, update, ask }